{
    "model_tr": "Model:",
    "style_tr": "Style:",
    "ilust_tr": "Ilustration (anime)",
    "photo_tr": "Photo",
    "noise_lvl": "Noise level:",
    "noise_none": "None",
    "blur_lvl": "Blur level.",
    "blur_none": "None",
    "expand_tr": "Expand",
    "expand_yes": "Yes",
    "expand_no": "No",
    "upscale_tr": "Upscale level",
    "select_image_tr": "Select image",
    "execution_tr": "Execution",
    "please_select_img": "Please select image",

    "msg_none": "",
    "msg_invalid_config": "Invalid configuration. Returning to default values.",
    "msg_esergan_not_av": "ESRGAN model not available, it may be added on the future",
    "msg_photo_not_av": "Only anime pictures are supported right now, but if you enter a photo, you may get an interesting result.",
    "heavy_op_warning": "This is a heavy operation.",
    "msg_experimental_feature": "This is an experimental feature. It may produce nightmare fuel content.",
    "msg_local_warning": "Local results are inferior due to the compressed model, app may crash if your image is too big and/or if you don't have enough computing resources on your device.",
    "msg_web_wanrning": "Requieres internet connection",

    "inp_height": "Input height:",
    "inp_widht": "Input width:",
    "expected_out": "Expected output size:",
    "start_btn": "Start",
    "confirmation_title": "Confirmation",
    "msg_image_saved": "Saved",
    "pre_process_warning": "If app crashes after touching the start button, you image may be to large to be processed in your device. Try again with a smaller image or try processing on web inestead of local",
    "pre_process_warning2": "Your image is about to be processed online, please watch an ad (and consider clicking it) in order to help me keep the server running.",
    "loading_dialog": "The app is working... this may take a while but it's ok as long as it doesn't crashes and closes.",
    "about": "About",
    "tip": "Tip",
    "mail": "Mail",

    "about_text1": "Super Resolution Waifu Neural Network is a convolutional neural network. Escentially an implementation of waifu2x (by nagadomi) on tensorflow but using my own anime gurl pics dataset (8k+ images) and making some tweaks to the model architecture which is based on VGG11.",
    "about_text2": "A reduced version of the model (tflite) is used to run on-device whereas the full model runs on web.",
    "about_text3": "More info about the model on my github.",
    
    "server_error": "Server error.",
    "common_errors":"Common errors:",
    "posible_error1":"- The server has decided to die and I'll have to fix it, try again later.",
    "posible_error2":"- Your app may be outdated, I recomend updating to the latest version in order to process your image on the server.",
    "posible_error3":"- Mantainace or updates are being deployed on the server, try again later.",
    "posible_error4":"- Keeping the server has become to expensive so I decided to stop the service and it may never return. I hope that this last one never happens, but in case it does you may still be able to process your images on your device."
}