{
    "model_tr": "Modelo:",
    "style_tr": "Estilo:",
    "ilust_tr": "Ilustración (anime)",
    "photo_tr": "Foto",
    "noise_lvl": "Nivel de ruido:",
    "noise_none": "Ninguno",
    "blur_lvl": "Nivel de desenfoque:",
    "blur_none": "Ninguno",
    "expand_tr": "Expandir",
    "expand_yes": "Si",
    "expand_no": "No",
    "upscale_tr": "Aumento",
    "select_image_tr": "Seleccionar imagen",
    "execution_tr": "Ejecución:",
    "please_select_img": "Seleccione una imagen",
    
    "msg_none": "",
    "msg_invalid_config": "Configuración invalida/no disponible.",
    "msg_esergan_not_av": "Modelo ESRGAN no disponible para procesamiento local. ESRGAN funciona mejor en fotos",
    "msg_photo_not_av": "El modelo de SRWNN para fotos aún es un trabajo en proceso.",
    "heavy_op_warning": "Esta es una operación pesada.",
    "msg_experimental_feature": "Característica experimental. Podria producir combustible de pesadilla.",
    "msg_local_warning": "Los resultados producidos localmente son inferiores a los producidos en web debido a la compresión  del modelo, la aplicación podría fallar si tu imagen es muy grande y/o no hay suficiente poder de procesamiento en tu dispositivo.",
    "msg_web_wanrning": " ",

    "inp_height": "Altura de entrada:",
    "inp_widht": "Ancho de entrada:",
    "expected_out": "Tamaño de salida esperado:",
    "start_btn": "Iniciar",
    "confirmation_title": "Confirmación",
    "msg_image_saved": "Guardado",
    "pre_process_warning": "Si la app falla después de oprimir el botón de inicio, significa que tu imagen es demasiado grande como para ser procesada en tu sipositivo. Intenta de nuevo con una imagen más pequeña o intenta procesar en web en lugar de local",
    "pre_process_warning2": "Tu imagen esta por ser procesada en un servidor, los anuncios solo aparecen cuando elijas la opción de procesar en servidor para ayudarme a mantener el servicio. Puedes remover los anuncios mejorando tu cuenta desde la web app.",
    "loading_dialog": "La app esta trabajando... esto puede tomar un rato pero esta bien mientras no se cierre.",
    "about": "Acerca de",
    "tip": "Dona",
    "mail": "Correo",

    "about_text1": "Super Resolution Waifu Neural Network es una red neuronal convolucional. Escencialmente una implementación de waifu2x (por nagadomi) en tensorflow pero usando mi propio dataset de imágenes de monas chinas (8k+) y haciendo algunos cambios en la arquitectura del modelo el cual esta basado en VGG11.",
    "about_text2": "Una versión reducida del modelo (tflite) es usada para ejecutarse en el dispositivo mientras que la versión completa se ejecuta en web.",
    "about_text3": "Más detalles del modelo SRWNN en mi github. Y más información acerca de la implementación de ESRGAN puede ser encontrada también en mi guthub.",

    "server_error": "Error de servidor.",
    "common_errors":"Errores comúnes",
    "posible_error0":"- Tu archivo es muy grande, intenta con uno más pequeño.",
    "posible_error1":"- El servidor ha decidido morir y lo tendré que arreglar, intenta de nuevo más tarde.",
    "posible_error2":"- Puede que tu aplicación este desactualizada, recomiendo que la actualices para poder procesar tu imágen en el servidor.",
    "posible_error3":"- Se esta llevando a cabo mantenimiento o se estan implementando actualizaciones, intenta más tarde.",
    "posible_error4":"- Mantener el servidor se ha vuelto muy caro, decidí detener el servicio y puede que nunca regrese. Espero que esta última no pase, pero en caso de que suceda, aún podrás procesar tus imágenes en tu dispositivo.",

    "server_image_error":"Ocurrió un error mientras se procesaba tu imágen.",
    "large_errors":"Puede que tu imagen sea muy grande. O el servidor esta muy ocupado.",

    "example":"Ejemplo",
    "img_in_ex":"Imágen de entrada",
<<<<<<< HEAD
    "img_out_ex":"Imágen de salida",

    "alloc_error":"Error en la asignación de tensores.",
    "alloc_error_desc":"Las dimensiones de la imágen son muy grandes como para ser asignadas y procesadas en el dispositivo. Intenta procesar en web.",

    "unknown_error":"Error desconocido.",

    "website": "Sitio web",
    "file_size": "Tamaño del archivo:",
    "login_or_register":"Iniciar sesión o registrarse",

    "register": "Registrarse",
    "enter": "Entrar",
    "incorrect_email_or_ps": "El correo o contraseña es incorrecto",
    "enter_emal": "Ingresar un correo",
    "email": "Correo",
    "ps": "Contraseña",
    "mail_not_recognized": "Correo no identificado",
    "enter_mail_to_reset_ps": "Ingrese un correo para poder recuperar contraseña",
    "6chr_or_more_ps_plz": "Ingresar contraseña de 6 o más carácteres",
    "reset_ps": "Reestablecer contraseña",
    "reset_ps_mail1": "Se le ha enviado un correo a ",
    "reset_ps_mail2": " para reestablecer su contraseña.",
    "enter_w_mi_account": "Entrar con mi cuenta",
    "enter_a_name": "Ingresar un nombre",
    "name": "Nombre",
    "last_name": "Apellido",
    "username": "Nombre de usuario",
    "enter_email": "Ingresar un correo",
    "password": "Contraseña",
    "confirm_ps": "Confirmar contraseña",
    "error_has_occured": "Ha ocurrido un error, intente nuevamente.",
    "ps_do_not_match": "Contraseña repetida no coincide",
    "forgot_ps": "Olvidé mi contraseña",

    "log_to_dl": "Inicia sesión o registrate para descargar tu imagen",
    "cancel": "Cancelar",
    "log_out": "Cerrar sesión",

    "limit_reached": "Haz alcanzado tu limite mensual de procesamiento/descarga de imágenes",
    "upgrade_pls": "Actualiza tu cuenta para poder seguir procesando y descargando imágenes ilimitadamente. Puedes actualizar tu subscripción desde la web app.",
    "return": "Regresar",
    "admin_sub": "Administrar subscripción",

    "help": "Ayuda",
    "faq1": "Mensualmente puedes procesar y descargar hazta 15 imágenes. Si quisiera procesar más imágenes, tienes que actualizar tu cuenta atravez de la web app (inicia sesión y navega a subscripción), por 69.00MNX al mes podrás procesar imágenes ilimitadas sin anuncios, también tendras acceso a los servicios de la web app.",
    "next": "Siguiente"


=======
    "img_out_ex":"Imágen de salida"
>>>>>>> parent of bbaf316... I think that the bug is fixed
}